//
// Created by Three on 2022/9/27.
//
#define _CRT_SECURE_NO_WARNINGS 1

#include "stdio.h"
//字符串的介绍标志：'\0'
// '\0' 0, '0' 的区别
// '\0'  转义字符 - ascii码 - 0
// 0 数字0  - ascii码 -  48
// '0' 字符0
//
//int Max(int num1, int num2){
//    if(num2> num1){
//        return num2;
//    }else{
//        return num1;
//    }
//}
//
//int main(){
//    int a = 50;
//    int b = 20;
//    int max = Max(a, b);
//    printf("%d\n", max);
//    return 0;
//}

//int main() {
//    int arr[] = {1, 2, 3, 4, 5, 6};
//    printf("%d\n", sizeof arr);
//    return 0;
//}

//        ~ 对一个数的二进制按位去反
//        -- 前置、后置 --
//        ++ 前置、后置 ++
//        * 间接访问操作符（解引用操作符）
//        (类型) 强制类型转化

int main() {
    // ~ 按位取反（2进制位）
    int a = 0; // 4个字节， 32bit位
    // 00000000000000000000000000000000
    // 按位取反
    // 11111111111111111111111111111111
    // 原码 反码 补码
    // 负数在内存中存储的时候， 存储的是二进制的补码
    int b = ~a; // b是有符号的整形
    // 如果是有符号的二进制 那么二进制的第一位 为该数的符号
    // 1010
    // 0101
    printf("%d\n", b); // -1 打印的是这个数的原码
    // 11111111111111111111111111111111  补码 - 1 = 反码
    // 11111111111111111111111111111110  反码 按位取反 = 原码
    // 10000000000000000000000000000001  原码
    return 0;
}



